app/Controllers/Startups/StartupsData.php

SELECT *
FROM `tb_master_sector`
WHERE `id_sector` = '24'
---
    public function fetch_data()
    {
        $sql_main = $this->_sql('main');

        if ($sql_main['error']) {
            return json_response(['status' => 0, 'message' => $sql_main['messages']]);
        }

        $query = $sql_main['query']->getResultArray();
        $data  = [];

        foreach ($query as $key) {
            $get_sector = $this->db->table('tb_master_sector')
                ->where('id_sector', $key['id_sector'])
                ->get()
                ->getRowArray();