app/Controllers/Analytic.php


        // 5. Check Existing Visitor for Today
        $builder = $this->db->table('tb_analytic_visitors_2025');
        $visitor = $builder->where('page_view', $url)
            ->where('ip_address', $ipaddress)
            ->where('DATE(waktu)', $date)
            ->where('referral', $referrer)
            ->get()
            ->getRowArray();
---
SELECT *
FROM `tb_analytic_visitors_2025`
WHERE `page_view` = 'shehacks-new.local/startups'
AND `ip_address` = '127.0.0.1'
AND DATE(waktu) = '2025-12-21'
AND `referral` = 'http://shehacks-new.local/'