app/Models/MasterSectorModel.php

SELECT *
FROM `tb_master_sector`
WHERE `status_delete` = 0
ORDER BY `nama` ASC
---
    public function getActiveSectors()
    {
        return $this->where('status_delete', 0)
            ->orderBy('nama', 'ASC')
            ->findAll();